tyeth/circuitpython/ports/espressif/boards/m5stack_cores3_se/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "M5Stack CoreS3 SE"
#define MICROPY_HW_MCU_NAME         "ESP32S3"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO5)

#define CIRCUITPY_BOARD_I2C         (2)
#define CIRCUITPY_BOARD_I2C_PIN     {{.scl = &pin_GPIO11, .sda = &pin_GPIO12}, \
                                     {.scl = &pin_GPIO1, .sda = &pin_GPIO2}}

#define DEFAULT_SPI_BUS_SCK (&pin_GPIO36)
#define DEFAULT_SPI_BUS_MOSI (&pin_GPIO37)
// GPIO35 is shared between the TF card MISO and the TFT D/C signal. The display
// claims it as D/C during board_init(), so board.SPI() must not also claim it.
#define CIRCUITPY_BOARD_SPI     (1)
#define CIRCUITPY_BOARD_SPI_PIN {{.clock = DEFAULT_SPI_BUS_SCK, .mosi = DEFAULT_SPI_BUS_MOSI, .miso = NULL}}

#define DEFAULT_UART_BUS_RX (&pin_GPIO18)
#define DEFAULT_UART_BUS_TX (&pin_GPIO17)
